Tekla.Structures.Model.SharingResultState
Indicates a state of Tekla Structures and model after sharing operation.

Tekla.Structures.Model.SharingResultState.Undefined
The underfined state. It is the default value which is also set when the code is not able to determine the current state.

Tekla.Structures.Model.SharingResultState.Ready
After a successfull operation or an error, model is still opened.
Remarks: Operations are possible immediately after the call has returned this state. Api client may proceed immediately.
NOTE: It is not possible to 100% guarantee that some plugin would not start an anynchronous operation, either built-in or thurd-party one. Still caution is advised.

Tekla.Structures.Model.SharingResultState.ModelReopened
After an error, model is reopened to the last saved.
Remarks: Strucrtures does not wait for the reopen to complete before returning this status. Api client must wait until the reopen completes before proceeding.

Tekla.Structures.Model.SharingResultState.ModelClosed
After an error, model is closed.
Remarks: Strucrtures does not wait for the close to complete before returning this status. Api client must wait until the close completes before proceeding.

Tekla.Structures.Model.SharingResultState.ProcessClosed
After an error, model is closed and Structures process closes.
Remarks: Practically, this outcome is mostly relevant for external applications because Structures would be closed before in-process plugin could handle the return.
Still even in case of external application Structures may close before returning the result to the application.